GopalSaraf/Practicals/PSDL/include/proc/pic12lf1552.inc
// Register: AADGRD
#define AADGRD AADGRD
AADGRD                                   equ 0718h
// bitfield definitions
AADGRD_GRDPOL_POSN                       equ 0005h
AADGRD_GRDPOL_POSITION                   equ 0005h
AADGRD_GRDPOL_SIZE                       equ 0001h
AADGRD_GRDPOL_LENGTH                     equ 0001h
AADGRD_GRDPOL_MASK                       equ 0020h
AADGRD_GRDAOE_POSN                       equ 0006h
AADGRD_GRDAOE_POSITION                   equ 0006h
AADGRD_GRDAOE_SIZE                       equ 0001h
AADGRD_GRDAOE_LENGTH                     equ 0001h
AADGRD_GRDAOE_MASK                       equ 0040h
AADGRD_GRDBOE_POSN                       equ 0007h
AADGRD_GRDBOE_POSITION                   equ 0007h
AADGRD_GRDBOE_SIZE                       equ 0001h
AADGRD_GRDBOE_LENGTH                     equ 0001h
AADGRD_GRDBOE_MASK                       equ 0080h

// Register: AADCAP
#define AADCAP AADCAP
AADCAP                                   equ 0719h
// bitfield definitions
AADCAP_ADDCAP_POSN                       equ 0000h
AADCAP_ADDCAP_POSITION                   equ 0000h
AADCAP_ADDCAP_SIZE                       equ 0003h
AADCAP_ADDCAP_LENGTH                     equ 0003h
AADCAP_ADDCAP_MASK                       equ 0007h
AADCAP_ADDCAP0_POSN                      equ 0000h
AADCAP_ADDCAP0_POSITION                  equ 0000h
AADCAP_ADDCAP0_SIZE                      equ 0001h
AADCAP_ADDCAP0_LENGTH                    equ 0001h
AADCAP_ADDCAP0_MASK                      equ 0001h
AADCAP_ADDCAP1_POSN                      equ 0001h
AADCAP_ADDCAP1_POSITION                  equ 0001h
AADCAP_ADDCAP1_SIZE                      equ 0001h
AADCAP_ADDCAP1_LENGTH                    equ 0001h
AADCAP_ADDCAP1_MASK                      equ 0002h
AADCAP_ADDCAP2_POSN                      equ 0002h
AADCAP_ADDCAP2_POSITION                  equ 0002h
AADCAP_ADDCAP2_SIZE                      equ 0001h
AADCAP_ADDCAP2_LENGTH                    equ 0001h
AADCAP_ADDCAP2_MASK                      equ 0004h

// Register: AADRES0L
#define AADRES0L AADRES0L
AADRES0L                                 equ 071Ah
// bitfield definitions
AADRES0L_ADRES0L_POSN                    equ 0000h
AADRES0L_ADRES0L_POSITION                equ 0000h
AADRES0L_ADRES0L_SIZE                    equ 0008h
AADRES0L_ADRES0L_LENGTH                  equ 0008h
AADRES0L_ADRES0L_MASK                    equ 00FFh

// Register: AADRES0H
#define AADRES0H AADRES0H
AADRES0H                                 equ 071Bh
// bitfield definitions
AADRES0H_ADRES0H_POSN                    equ 0000h
AADRES0H_ADRES0H_POSITION                equ 0000h
AADRES0H_ADRES0H_SIZE                    equ 0008h
AADRES0H_ADRES0H_LENGTH                  equ 0008h
AADRES0H_ADRES0H_MASK                    equ 00FFh

// Register: AADRES1L
#define AADRES1L AADRES1L
AADRES1L                                 equ 071Ch
// bitfield definitions
AADRES1L_ADRES1L_POSN                    equ 0000h
AADRES1L_ADRES1L_POSITION                equ 0000h
AADRES1L_ADRES1L_SIZE                    equ 0008h
AADRES1L_ADRES1L_LENGTH                  equ 0008h
AADRES1L_ADRES1L_MASK                    equ 00FFh

// Register: AADRES1H
#define AADRES1H AADRES1H
AADRES1H                                 equ 071Dh
// bitfield definitions
AADRES1H_ADRES1H_POSN                    equ 0000h
AADRES1H_ADRES1H_POSITION                equ 0000h
AADRES1H_ADRES1H_SIZE                    equ 0008h
AADRES1H_ADRES1H_LENGTH                  equ 0008h
AADRES1H_ADRES1H_MASK                    equ 00FFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADACQ0                           BANKMASK(AADACQ), 0
#define ADACQ1                           BANKMASK(AADACQ), 1
#define ADACQ2                           BANKMASK(AADACQ), 2
#define ADACQ3                           BANKMASK(AADACQ), 3
#define ADACQ4                           BANKMASK(AADACQ), 4
#define ADACQ5                           BANKMASK(AADACQ), 5
#define ADACQ6                           BANKMASK(AADACQ), 6
#define ADCONV                           BANKMASK(AADSTAT), 2
#define ADDCAP0                          BANKMASK(AADCAP), 0
#define ADDCAP1                          BANKMASK(AADCAP), 1
#define ADDCAP2                          BANKMASK(AADCAP), 2
#define ADDSEN                           BANKMASK(AADCON3), 0
#define ADEPPOL                          BANKMASK(AADCON3), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADIPEN                           BANKMASK(AADCON3), 1
#define ADIPPOL                          BANKMASK(AADCON3), 6
#define ADOEN                            BANKMASK(AADCON3), 4
#define ADOOEN                           BANKMASK(AADCON3), 3
#define ADPRE0                           BANKMASK(AADPRE), 0
#define ADPRE1                           BANKMASK(AADPRE), 1
#define ADPRE2                           BANKMASK(AADPRE), 2
#define ADPRE3                           BANKMASK(AADPRE), 3
#define ADPRE4                           BANKMASK(AADPRE), 4
#define ADPRE5                           BANKMASK(AADPRE), 5
#define ADPRE6                           BANKMASK(AADPRE), 6
#define ADSTG0                           BANKMASK(AADSTAT), 0
#define ADSTG1                           BANKMASK(AADSTAT), 1
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define CARRY                            BANKMASK(STATUS), 0
#define CFGS                             BANKMASK(PMCON1), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_nA                             BANKMASK(SSP1STAT), 5
#define FREE                             BANKMASK(PMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GRDAOE                           BANKMASK(AADGRD), 6
#define GRDBOE                           BANKMASK(AADGRD), 7
#define GRDPOL                           BANKMASK(AADGRD), 5
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(PMCON1), 5
#define OSTS                             BANKMASK(OSCSTAT), 5
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RD                               BANKMASK(PMCON1), 0
#define RSEN                             BANKMASK(SSP1CON2), 1
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SDO1SEL                          BANKMASK(APFCON), 6
#define SDOSEL                           BANKMASK(APFCON), 6
#define SDSEL                            BANKMASK(APFCON), 4
#define SEN                              BANKMASK(SSP1CON2), 0
#define SMP                              BANKMASK(SSP1STAT), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SS1SEL                           BANKMASK(APFCON), 5
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define SSSEL                            BANKMASK(APFCON), 5
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define UA                               BANKMASK(SSP1STAT), 1
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WR                               BANKMASK(PMCON1), 1
#define WREN                             BANKMASK(PMCON1), 2
#define WRERR                            BANKMASK(PMCON1), 3
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nRWDT                            BANKMASK(PCON), 4
#define nTO                              BANKMASK(STATUS), 4
#define nWPUEN                           BANKMASK(OPTION_REG), 7

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12LF1552_INC_
